In [1]:
import pandas as pd
import numpy as np

In [5]:
data = pd.read_csv("taxicab-20.csv", header=None)
grouped = data.groupby(0).mean() // 1
grouped

         1
0
2      5.0
4      8.0
6     13.0
8     21.0
10    35.0
12    64.0
14   124.0
16   284.0
18   574.0
20  1147.0

In [38]:
pd.DataFrame(np.unique(data[0], return_counts=True))

   0   1   2   3   4    5    6    7     8     9     10    11   12  13
0   4   6   8  10  12   14   16   18    20    22    24    26   28  30
1   1   4  10  36  68  192  465  988  1663  2366  2413  1388  389  17

In [4]:
under_20 = pd.read_csv("taxicab-20.csv", header=None)
# under_20.groupby(0).mean()
combined = data.append(under_20)
combined.groupby(0).mean() // 1

C:\Users\wpdtj\AppData\Local\Temp\ipykernel_28592\84928036.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  combined = data.append(under_20)

          1
0
2       5.0
4       8.0
6      14.0
8      21.0
10     35.0
12     63.0
14    124.0
16    275.0
18    558.0
20   1127.0
22   2310.0
24   5024.0
26  11409.0
28  27664.0
30  73215.0